[
  {
    "id": "on-how-things-got-here",
    "title": "On how things got here",
    "excerpt": "From SKGChess and this page to the decision to make a game and share the process publicly.",
    "date": "February 2026",
    "content": "<p>To understand how I got here, I need to start in November 2024, when I began working on the project SKGChess.</p><p>At that time, my focus was clear: become a better engineer. In my mind, that meant better work positions, and better positions meant more success. I work as a software engineer and I respect my field. Back then, that respect alone was enough to give meaning to the effort.</p><p>When I chose to build a chess app, the decision was not only practical. I already liked chess, so it made sense from a motivation standpoint. But there was something else present. Even though my main framework was professional growth, I was beginning to look for something that meant more personally.</p><p>I had just started feeling that working as a software engineer provided personal meaning and professional growth, but it did not feel like it had a meaningful social impact. It did not allow me to interact with people in a way that felt connected to something larger than myself.</p><p>For the first time, I felt the need for my work to express me personally and to carry some form of social meaning. Chess is not only something I like, but something I have communicated openly about with other people and analyzed for hours. Chess is not isolated. It is played with others. It exists between people. Much like I play games and connect with others on well-known chess platforms, I understood that building a chess app meant creating something that could enter that same shared space. It would exist in interaction.</p><p>These thoughts led me to work on SKGChess for nearly 10 months. What started as a small self-improvement project gradually became something much bigger than I initially expected. It was no longer just practice. It became commitment.</p><p>After finishing SKGChess, I also launched this page, ixlstudio.com — not in its current form, but as an attempt at freelancing. The intention was still professional positioning. Build something. Present it. Move forward.</p><p>Completing both made something clear.</p><p>I had created something that I was genuinely proud of. I gave my aesthetics. I made deliberate decisions. They reflected discipline and care. They expressed a part of me.</p><p>But they are rather limited in what they can express. They cannot fully express what I think and what I value.</p><p>That gap stayed with me.</p><p>If these did not fully express me, then working purely as an employee would not either — at least not in the way I need. Employment has value. Personal relationships at work have value. Employment sustains life. But usefulness alone is not enough for me.</p><p>I want to feel connected through my work.</p><hr><p>Over the past months, I took a step back.</p><p>I questioned whether creation needed to remain central. I considered shifting my focus toward simply enjoying life.</p><p>During that time, I went back and forth. I began thinking more seriously about creating a game, since it felt like a logical continuation of engineering. It would still involve technical structure, but it would also allow space for expression.</p><p>I questioned whether this idea was based only on interest or whether it was something I genuinely needed in order to express myself. I acknowledged that liking games alone is not enough reason to make one. Enjoyment is not the same as necessity. I wanted to understand whether I genuinely needed to express ideas through this medium, or whether I was only attracted to the idea of making a game. I examined how much of it was curiosity, how much was ambition, and how much was expression.</p><p>Even after questioning it from different angles, the idea kept returning: making a game.</p><p>Which brings me to today.</p><p>I now feel ready to take this idea seriously. Not as a casual experiment, but as a committed project. I want to approach it with full professional seriousness — not as a hobby or a side project — while at the same time allowing it to carry personal meaning.</p><p>I do not want to separate professionalism from authenticity. I do not want to choose between advancing my skills and expressing something that reflects who I am.</p><p>In that sense, choosing to pursue game creation is not a rejection of engineering. But an expansion of it.</p><p>At the same time, I want to share the entire process publicly. Not only the final game, but the decisions, the doubts, the adjustments, and the learning.</p><p>In this way, the process itself becomes the connection I am searching for with people, not just the finished game.</p><p>If you want to follow this process — the creation of the game and the documentation of its internal decisions and thoughts — you can find it on the home page under the name “Changing Ways.”</p><p>Thank you for reading.</p>"
  }
]
