[{"id":"on-how-things-got-here","title":"On how things got here","excerpt":"From SKGChess and this page to the decision to make a game and share the process publicly.","date":"February 2026","content":"<p>To understand how I got here, I need to start in November 2024, when I began working on the project SKGChess.</p><p>I work as a software engineer, and at that time my focus was simple: keep improving. Improvement meant security and better positions. I was not aggressively pursuing advancement, but I had internalized the common belief that progress is measured by money and professional standing.</p><p>When I chose to build a chess app, the decision was not only practical. I already liked chess, so it made sense from a motivation standpoint. At the same time, I had started to recognize that professional growth alone was not enough.</p><p>Working as a software engineer provided stability, structure, and measurable progress. It allowed me to improve technically. However, it did not feel socially impactful. The work was useful, but it did not allow much direct interaction or expression beyond implementation.</p><p>I began to want my work to reflect more than competence. I wanted it to carry some personal meaning and exist in interaction with others.</p><p>Chess already existed in a shared space. I had spent years playing and discussing it with others. It is not isolated; it depends on interaction. Building a chess app meant contributing to that same shared environment. It was still engineering, but it was also participation.</p><p>These considerations led me to work on SKGChess for nearly 10 months. What began as a self-improvement project became a structured commitment. I wanted to complete it properly.</p><p>After finishing SKGChess, I launched this page, ixlstudio.com — initially as a freelancing attempt. The intention was still professional positioning: build something, present it, move forward.</p><p>Completing both projects clarified something.</p><p>I had created something I was proud of. I made deliberate decisions. I applied my aesthetics. The result reflected discipline and care.</p><p>At the same time, I recognized a limitation.</p><p>The projects demonstrated skill, but they did not fully represent how I think or what I value. They showed execution, but not the broader reasoning behind it.</p><p>That distinction stayed with me.</p><p>If even personal projects could not fully represent that dimension, then employment alone would not either — at least not in the way I am looking for. Employment has value. It sustains life and builds relationships. But usefulness by itself is not sufficient for me.</p><p>I want my work to create connection.</p><p>Over the past months, I took distance from structured projects.</p><p>I questioned whether creation needed to remain central. I considered shifting toward simply living without attaching meaning to building.</p><p>During that time, I analyzed the idea of making a game more seriously. It appeared as a logical continuation of engineering: systems, structure, constraints — but with room for expression.</p><p>I examined my motivations. Liking games is not enough reason to build one. Enjoyment alone does not justify the effort. I needed to determine whether this medium was necessary for expressing ideas, or whether I was only attracted to the concept of it.</p><p>After reviewing it from different angles, the idea remained consistent: making a game.</p><p>Which brings me to today.</p><p>I am ready to treat this as a serious project. Not casually, and not only experimentally. I want to approach it with professional discipline while allowing it to carry personal meaning.</p><p>I do not want to separate skill development from expression.</p><p>Pursuing game creation is not a rejection of engineering. It is an extension of it.</p><p>At the same time, I intend to share the process publicly — including the decisions, revisions, and reasoning behind it.</p><p>If an audience forms, that interaction becomes part of the environment in which the game is developed.</p><p>If you want to follow this process — the development of the game and the documentation of its internal decisions and reasoning — it is available on the home page under the name \"Changing Ways.\"</p><p>Thank you for reading.</p>"}]
