[{"id":"on-how-things-got-here","title":"On how things got here","excerpt":"From SKGChess and this page to the decision to make a game and share the process publicly.","date":"February 2026","content":"<p>Hi, my name is Haris.</p><p>Welcome to this place.</p><p>To help you understand what this place is about, let me take you on a short step back in time and tell a story that begins in November 2024, when I start working on SKGChess.</p><p>The setting is the following.</p><p>I am working as a software engineer. A job that provides stability, financial security, and a sense of accomplishment. Also, a field that allows me to grow, and create meaningful professional relationships.</p><p>At the time, I have internalized the idea that progress is measured by income and professional standing. Thus, my goal is simple : keep improving my engineering skills so that i. I maintain stronger job security and ii. better the possibility of advancing to higher-income positions over time.</p><p>I begin searching for a project to build. One that would help me to actually learn, put as highlight in my portfolio and ideally enjoy, as I will spend personal time building it. I notice that, for the first time in my work, I am searching of creating something that also has meaning to me (beyond the development process itself).</p><p>Since I already enjoyed chess and have always admired it for its intellectual level, I choose to begin working on what was at the time a chess engine.</p><p>Working on this chess engine, makes me understand one thing. I want to be able to share what I am doing with others. I am excited proud beyond the technical stuff for my project, that I want to communicate it. In that way, it will tell a story of myself.</p><p>The enthusiasm evolves into something bigger : Over the next 10 months, I develop a complete multiplayer chess game, SKGCHESS. What started as a portfolio project gradually occupies most of my personal time. I try to shape it in a way that reflects my aesthetic and my decisions.</p><p>With SKGCHESS being completed and played with friends and colleagues, I try to explore the idea of being more involved in creating.</p><p>I launch this page ixlstudio.com, in August 2025, initially as a freelancing platform. The idea is simple: be expressed.</p><p>However, as I begin searching for clients, I realize something. Client work will not provide the same creative freedom I experienced while building SKGCHESS. At the same time, I recognize that even SKGCHESS expresses only a small part of me.</p><p>Over the next few months, I think carefully about what I actually want.</p><p>There is a shift in perspective. The earlier mindset — where progress equals status — begins to lose priority. I start valuing authenticity over external approval.</p><p>My enthusiasm results in working on a multiplayer chess game, SKGCHESS, for the next 10 months. What started as a portfolio project, quickly occupied most of my personal time, as I tried to make it as me as possible, trying to tell \"my story\".</p><p>Next, with SKGCHESS completed, and seen and visited by friends in my circle and at work, I try to explore the idea of creating more alike projects. Or more projects that are personal, and in a way express myself. I launch this page, ixlstudio.com, in August 2025, initially as a freelancing platform, with that goal in mind. Despite being happy with the overall creation process, when searching for clients I realized I will not have the same freedom as I did in creating SKGCHESS. Moreover, I am starting to think that even SKGCHESS, expressed just a tiny part of me, while I feel the need to express much more.</p><p>There is a shift in viewpoint, from one that values success, to one that values to remain authentic to self.</p><p>I question everything. Should creation remain central in my life? Or could I live without attaching purpose to creating?</p><p>Moreover, why I feel the need to still talk about my creations ? In the end everything we do in life are creations.</p><p>During this period, I begin exploring forms of creation beyond traditional software engineering. Specifically, I examine the idea of making a game. It appears as a logical continuation of engineering, but with more openness to creativity and emotional expression.</p><p>I question my motivations carefully. Liking games is not enough reason to build one. Enjoyment alone does not justify the effort. I need to understand whether this medium is necessary for expressing ideas, or whether I am only attracted to the concept of making a game.</p><p>From September 2025 until today, 24/2/2026, I explore this direction in depth.</p><p>I read books on game design.</p><p>I experiment with 2D and 3D art.</p><p>I write a story to communicate what I want to express.</p><p>I test different game engines.</p><p>Eventually, I reach a conclusion.</p><p>I am ready to treat this as a serious project. I want to approach it with professional discipline while allowing it to carry personal meaning.</p><p>While doing so, I decide to place the creation process at the center of it all. So my plan is the following:</p><p>I will create a game and share the entire process publicly. This means I will document the full creative process and my inner thinking, while also learning publicly on YouTube.</p><p>If you want to support this idea — or are simply curious to see what I will be creating — feel free to come back here from time to time or follow my channel.</p><p>Thank you for reading.</p>"}]
