// [
//   {"id":"letter-from-the-creator-0","title":"Letter 0.","excerpt":"An introduction and the beginning of a story that starts in November 2024.","date":"February 2026","content":"<p>Hi, my name is Haris.</p><p>Welcome to this place.</p><p>To help you understand what this is all about and what to expect, let me take you on a short step back in time and tell a story that begins in November 2024.</p>"},
//   {"id":"letter-from-the-creator-1","title":"Letter 1. ","excerpt":"Working as a software engineer, searching for meaning, and deciding to build a project.","date":"February 2026","content":"<p>At that time, I was working as a software engineer, still relatively new to the field, with two years of experience. I was satisfied with my work, but I had reached a point where it felt necessary to examine how I could evolve further within this profession. Simply enjoying the routine was not enough. I was searching for something more. A greater sense of meaning, or perhaps something that would allow me to dream bigger.</p><p>After thinking things through, I decided that the plan was straightforward : <br><br>I would continue improving my engineering skills in order to : <br><br> 1) maintain strong job security, <br> 2) increase the possibility of advancing to higher-income positions, and <br> 3) potentially explore freelancing.</p><p>With that mindset, I began searching for a project to build, one that would allow real learning, strengthen my portfolio, and ideally be enjoyable enough to justify spending personal time on it.</p>"},
//   {"id":"letter-from-the-creator-2","title":"Letter 2.","excerpt":"Choosing chess, building an engine, then turning it into a web app and SKGCHESS.","date":"February 2026","content":"<p>Since, I already enjoyed chess and admired its intellectual depth, I chose to begin working on what was initially a chess engine.</p><p>While building this chess engine, though, I realized it would be wiser to share the work publicly and showcase it properly. However, the tutorials I had followed at the time resulted in an engine that ran only locally, and so I began researching on my own how to turn it into a web application.</p><p>Transforming it into one also opened another possibility: playing with other players. That would make the experience more enjoyable, and allow me to demonstrate stronger skills, ultimately making the project more engaging.</p><p><b>At this point things begin to shift.</b> <br><br>Once the project became multiplayer and centered around something I genuinely loved, I started envisioning what I truly wanted to create. It was no longer just about building a functional engine or improving technically. I began wanting to shape something more personal.</p><p>I found myself exploring color palettes, adjusting proportions, and fine-tuning behavior. Although, small visual and interaction details took hours of iteration, at some point, it finally clicked, and the look and behavior aligned with what I had envisioned.</p><p>SKGCHESS ended up taking around nine months of continuous iteration, with breaks in between. Each return to the project brought adjustments, refinements, and new ideas. Although I was aware that this was not the typical way software engineering is approached and scoped, I no longer cared about following that model. The process became exploratory rather than optimized.</p><p>What began as an experiment became a large-scale project, one that can be explored in detail <a href=\"skgchess.html\">on the home page</a>. It is something I am proud of and a project that tells a part of my story.</p>"},
//   {"id":"letter-from-the-creator-3","title":"Letter 3.","excerpt":"After SKGCHESS, launching ixlstudio.com and the internal shift toward making a game.","date":"February 2026","content":"<p><b>The completion of SKGCHESS marked another turning point.</b></p><p>Despite being tremendously proud of what I had accomplished, the fact that all of that effort remained only a side project forced me to rethink things. SKGCHESS had shown me what was possible when I committed deeply to something personal. But at the same time, it showed me that there are things I want to talk about and must find a way of doing so. Find a way to communicate what I want.</p><p>As a result, in August 2025, this page — ixlstudio.com — was launched, initially as a freelancing platform.</p><p>After exploring this direction for two months and feeling satisfied with it, when the moment came to truly initiate it, it did not feel authentic to me. During that period, there were also discussions about SKGCHESS potentially being used within a local chess club, which further highlighted the direction I was moving in, yet even that did not resolve the internal hesitation.</p><p>At the same time, SKGCHESS itself was not something that could be reproduced in the same way. It had already been lived. The meaning it carried came from that specific moment, that specific process. Repeating another engineering personal project would not recreate that experience.</p><p><b>From this perspective, an internal battle began.</b> It felt as though pursuing something different would require \"leaving\" my engineering aspirations behind—something difficult to accept. Especially as someone perfectionistic by nature, someone used to structured growth and measurable progress. Yet the thought that kept returning, the one that had appeared many times in the past, was clear: to make a game. Not just any game, but one capable of evoking emotion—the kind of experience many of the games I had played once created in me.</p><p>Of course, I considered this with full awareness of the limitations: working solo, and no guarantee of financial return—perhaps none at all. So it became clear that I should undertake such an endeavor only when I feel unable to do otherwise.</p>"},
//   {"id":"letter-from-the-creator-4","title":"Letter 4.","excerpt":"Exploring game development, placing the process at the center, and the commitment to share it.","date":"February 2026","content":"<p>From September 2025 until today February 24, 2026, I explored this direction in depth.</p><ul><li>I read books on game design.</li><li>I experimented with 2D and 3D art.</li><li>I wrote a story to communicate what I want to express.</li><li>I tested different game engines.</li></ul><p>Eventually, I reached a conclusion.</p><p>I am ready to undertake this attempt seriously. To approach it with professional discipline, while allowing it to carry personal meaning. But with one clear shift in focus :</p><p>The creation process itself would be placed at the center.</p><p>And what I mean by that is that I care about meaning and exploration. And <b>sharing what I learn along the way</b> is part of that meaning. Perhaps you reading this resonate with these thoughts. Perhaps you find yourself at a similar point in life. Maybe someone will come across this later and feel encouraged to begin their own journey.</p><p>So here is my commitment:</p><ul><li>I will give my full effort to create a game that expresses me, doing everything within my ability to see it through.</li><li>I will share the entire process publicly, documenting the full creative process as it unfolds.</li></ul><p>As implied earlier, I have no significant prior experience in game development, and that is intentional. <b>My goal is to document what it genuinely takes to build a game</b>: <br><br>the learning curve, the mistakes, the uncertainty, and the persistence behind it.</p><p>If you would like to be part of this journey, you can:</p><ul><li>Follow the project in Behind the Scenes section in ixlstudio.com, where you can find it with the codename \"Changing Ways\".</li><li>Subscribe on YouTube, where I will be also sharing the entire experience as it unfolds.</li></ul><p>Thank you for reading.</p>"}
// ]
