[
  {
    "id": "on-why-approach-game-development",
    "title": "On Why To Approach Game Development",
    "excerpt": "Why I decided to make games, how I chose 2D and Godot, and why I think everyone should find their own path.",
    "date": "February 2026",
    "content": "<p>ας ξεκινησουμε με μερικα πραγματα που πρεπει να πω. εαν καποιος ξεκινησει να ψαχνει για να δημιουργησει παιχνιδια θα δει πολλα tutorials, ρητα του τυπου start small, και γενικοτερα περιεχομενο δεν λεει πραγματικα πως καποιος χτιζει ενα παιχνιδι. Αυτο γιατι προκειται για μια πολυ δυσκολη και χρονοβορα διαδικασια.</p><p>Ας ξεκινησω με κατι πιο σημαντικο. Ειναι διαφορετικο να παιζεις παιχνιδια και διαφορετικο να φτιαχνεις παιχνιδια. Οταν μετα απο καποια χρονια εργασιας σαν προγραμματιστης, ξεκινησα να ψαχνω καποιο μεγαλυτερο κοινωνικο νοημα απο την δουλεια μου, η πρωτη μου σκεψη ηταν οτι μπορω να κανω κατι που εχω δει πολλους να το κανουν, αλλα ξερω οτι ειναι δυσκολο και οι πιθανοτητες το παιχνιδι να τελειωσει, ποσο μαλλον να ειναι καλο και αν ειναι καλο να πουλησει, ειναι λιγες.</p><p>Για αυτο οταν ξεκινησα να ασχολουμαι εκανα μερικα tutorial σε καθε engine απλα και μονο για να δω πως ειναι. Αυτο που με απασχολουσε ειναι αν ειναι αυτο το αντικειμενο που θελω να ασχοληθω για να βρω αυτο το μεγαλυτερο νοημα. Να δημιουργησω κατι που εκραζει τις αποψεις μου και γενικοτερα να παραμεινω αυθεντικος στον ευατο μου. Το αν θα τα καταφερω θα φανει στην πορεια, αλλα ειμαι πεπεισμενος οτι θα το κανω.</p><p>Για αυτο ξεκινησα αφου ειδα λιγα tutorial, διαβασα καποια βιβλια για game design, καταλαβα τι ειναι το καθε game engine, πως δημιουργειται το art (3d ή 2d) χωρις να εχεις γνωσεις art, klp. epeita εκατσα εγραψα μια ιστορια που σκεφτηκα και μπορω να αποτυπωσω ολα αυτα που θελω πω, τοσο απο περιεχομενο και ιδεες, οσο και απο αισθητικη αποψη.</p><p>Επειτα ηρθε η πραγματικη ερωτηση. πως μπορω ρεαλιστικα να φτιαξω αυτο το πραγμα σε βαθμο που δεν θα τρελαθω και θα μπορεσω να το τελειωσω. η απαντηση ειναι αν και θελω να ασχοληθω με 3d, πρεπει να ξεκινησω απο 2d. αυτο κυριως γιατι με ενδιαφερει πολυ το art στο παιχνιδι να ειναι δικα μου assets. καθως δεν ειμαι 3d artist πρεπει να παραμεινω ρεαλιστης και να φτιαξω κατι σε 2d.</p><p>to engine που διαλεξα ειναι η godot για προσωπικους λογους, κυριως γιατι ειναι open source και λειτουργει με modular τροπο. αυτη ηταν η δικη μου πορεια εξερευνησης πριν αποφασισω να ξεκινησω αυτο το εγχειρημα εδω. συνιστω σε οποιον θελει να δημιουργησει κατι να βρει το δικο του μονοπατι, και να μην ακουσει κανεναν. εγω απλα θα προσπαθησω να μοιραστω το δικο μου εδω, και οπου οδηγησει.</p>"
  },
  {
    "id": "creation-process",
    "title": "On the creation process",
    "excerpt": "How I approach building something from scratch: ideas, discipline, and sharing the journey.",
    "date": "February 2026",
    "content": "<p>I wanted to write a short note on how I think about the creation process — especially when it comes to games or any long-term project.</p><p>It usually starts with an idea that won't leave. Then comes the hard part: turning that into a habit. I try to work in small steps, document as I go, and keep the scope tight so I can actually finish.</p><p>Sharing the process (here and on YouTube) keeps me accountable and helps me see the path from “early idea” to “something playable.” This article is a placeholder — you can edit <code>articles.json</code> and change this content to whatever you like. Add more objects to the array to get more articles on the site.</p>"
  }
]
